bridget_mcmahon/week05/wednesday/world/app/views/cities/_form.html.erb

SELECT "countries"."name", "countries"."id" FROM "countries"
---
      <%= f.label :country_id %>
      <%= f.select :country_id, Country.pluck(:name, :id), :include_blank => true %>