jessica_diver/week05/wednesday/band_list/app/controllers/albums_controller.rb

  def index
    @albums = Album.all.order(:title)
---
SELECT "albums".* FROM "albums" ORDER BY "albums"."title" ASC

  def show
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    album = Album.create album_params
---
INSERT INTO "albums" ("title", "year", "songs", "length", "cover", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dance Moves"], ["year", "2018"], ["songs", 8], ["length", 31], ["cover", "https://images-na.ssl-images-amazon.com/images/I/51A2%2BKbQnJL._SS500.jpg"], ["band_id", 3]]

  def edit
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    album = Album.find params[:id]
    album.update album_params
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1 WHERE "albums"."id" = $2  [["band_id", 5], ["id", 2]]