jessica_diver/week05/wednesday/band_list/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC
---
  def index
    @bands = Band.all.order(:name)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @band = Band.find params[:id]

INSERT INTO "bands" ("name", "country", "genre", "followers", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    band = Band.create band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @band = Band.find params[:id]

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1 WHERE "bands"."id" = $2  [["name", "Cannibal Corpse"], ["id", 6]]
---
  def update
    band = Band.find params[:id]
    band.update band_params