danny_ceccattini/week05/gastronomia/app/views/regions/show.html.erb

<!-- XXX LIST OF DISHES -->
<% @region.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."region_id" = $1  [["region_id", 1]]