elena_ovsyannikova/week5/day2/city_library/app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @cities = City.all

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @city = City.find params[:id]

INSERT INTO "cities" ("name", "image", "population", "square", "country") VALUES (?, ?, ?, ?, ?)  [["name", "Samara"], ["image", ""], ["population", 1200000.0], ["square", 2000000.0], ["country", "Russia"]]
---
  def create
    city = City.new
    city.name= params[:name]
    city.image= params[:image]
    city.population= params[:population]
    city.square= params[:square]
    city.country= params[:country]
    city.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @city = City.find params[:id]

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "population" = ? WHERE "cities"."id" = ?  [["population", 3000000.0], ["id", 1]]
---
  def update
    city = City.find params[:id]
    city.name= params[:name]
    city.image= params[:image]
    city.population= params[:population]
    city.square= params[:square]
    city.country= params[:country]
    city.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 3]]
---
  def destroy
    city = City.find params[:id]
    city.destroy