sean_mccusker/homework/week05/movie-directors/app/views/directors/show.html.erb

SELECT "films".* FROM "films" WHERE "films"."director_id" = $1  [["director_id", 1]]
---

<% @director.films.each do |film| %>