bridget_mcmahon/week05/wednesday/world/app/views/countries/show.html.erb

SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = $1  [["country_id", 1]]
---
    <ul>
      <% @country.cities.each do |city| %>