jessica_diver/week05/wednesday/band_list/app/views/albums/_form.html.erb

SELECT "bands"."name", "bands"."id" FROM "bands"
---
  <%= f.label :band_id %>
  <%= f.select :band_id, Band.pluck(:name, :id), :include_blank => true %>