jessica_diver/week05/wednesday/band_list/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
<ul>
  <% if @album.band.present? %>