sean_mccusker/homework/week05/movie-directors/app/controllers/directors_controller.rb

SELECT "directors".* FROM "directors"
---
  def index
    @directors = Director.all

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @director = Director.find params[:id]

INSERT INTO "directors" ("name", "birth_place", "dob", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    director = Director.create director_params

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @director = Director.find params[:id]

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "image" = $1, "updated_at" = $2 WHERE "directors"."id" = $3  [["image", "https://nerdist.com/wp-content/uploads/2015/01/Leone.jpg"], ["updated_at", "2019-01-16 23:04:22.980487"], ["id", 3]]
---
  def update
    director = Director.find params[:id]
    director.update director_params

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = $1  [["id", 4]]
---
  def destroy
    director = Director.find params[:id]
    director.destroy