sean_mccusker/homework/week05/movie-directors/app/controllers/films_controller.rb

  def index
    @films = Film.all
---
SELECT "films".* FROM "films"

  def show
    @film = Film.find params[:id]
---
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    film = Film.create film_params
---
INSERT INTO "films" ("title", "year", "rotten_tomatoes", "image", "director_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Seven Samurai"], ["year", "1954"], ["rotten_tomatoes", "100%"], ["image", "https://images-na.ssl-images-amazon.com/images/I/51175A95QSL._SY445_.jpg"], ["director_id", 2]]

  def edit
    @film = Film.find params[:id]
---
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    film = Film.find params[:id]
    film.update film_params
---
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "films" SET "director_id" = $1 WHERE "films"."id" = $2  [["director_id", 1], ["id", 1]]