sean_mccusker/homework/week05/mountains_app/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains"
---
  def index
    @mountains = Mountain.all

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

INSERT INTO "mountains" ("name", "image", "country", "height", "age") VALUES (?, ?, ?, ?, ?)  [["name", "Mt. Ranier"], ["image", "https://upload.wikimedia.org/wikipedia/commons/e/eb/Mount_Rainier_from_west.jpg"], ["country", "USA"], ["height", 4392.0], ["age", 500000.0]]
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.mountain_range = params[:mountain_range]
    mountain.age = params[:age]
    mountain.save # INSERT, will set a new ID

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://iconicphotos.files.wordpress.com/2018/05/bad6266d-6c5c-4a2a-a112-50089a637420.jpg?w=809"], ["id", 2]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.mountain_range = params[:mountain_range]
    mountain.age = params[:age]
    mountain.save # UPDATE

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 1]]
---
  def destroy
    # DELETE /mountains/:id
    mountain = Mountain.find params[:id]
    mountain.destroy # Galactus