sean_mccusker/homework/week05/solar_system/app/controllers/planets_controller.rb

SELECT "planets".* FROM "planets"
---
  def index
    @planets = Planet.all

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @planet = Planet.find params[:id]

INSERT INTO "planets" ("name", "image") VALUES (?, ?)  [["name", "Mercury"], ["image", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Mercury_in_color_-_Prockter07-edit1.jpg/1200px-Mercury_in_color_-_Prockter07-edit1.jpg"]]
---
  def create
    planet = Planet.new
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save # INSERT, will set a new ID

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @planet = Planet.find params[:id]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "planets" SET "orbit" = ?, "diameter" = ?, "moons" = ? WHERE "planets"."id" = ?  [["orbit", 687.0], ["diameter", 6780.0], ["moons", 2], ["id", 8]]
---
  def update
    planet = Planet.find params[:id]
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save # UPDATE

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 9]]
---
  def destroy
    # DELETE /planets/:id
    planet = Planet.find params[:id]
    planet.destroy # Galactus