jessica_diver/week05/tuesday/mountains_app/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains"
---
  def index
    @mountains = Mountain.all

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

INSERT INTO "mountains" ("name", "ranking", "height", "country") VALUES (?, ?, ?, ?)  [["name", "Mt Everest"], ["ranking", 1], ["height", 8848.0], ["country", "Nepal"]]
---
  def create
    @mountain = Mountain.new
    @mountain.name = params[:name]
    @mountain.ranking = params[:ranking]
    @mountain.image = params[:image]
    @mountain.height = params[:height]
    @mountain.country = params[:country]
    @mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://natgeo.imgix.net/factsheets/thumbnails/MountEverestHeader.jpg?auto=compress,format&w=1024&h=560&fit=crop"], ["id", 2]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.ranking = params[:ranking]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.country = params[:country]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 4]]
---
  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy