william_ding/week05/tuesday/players_app/app/controllers/concerns/players_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @player = Player.find params[:id]

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @player = Player.find params[:id]

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "image" = ? WHERE "players"."id" = ?  [["image", "https://media.licdn.com/dms/image/C4D03AQGvcxmoXhnX8g/profile-displayphoto-shrink_200_200/0?e=1553126400&v=beta&t=384yCKP-dACdJRQE4tx5DUaYRMvFY5J8YUFyXgg8rWo"], ["id", 1]]
---
  def update
    player = Player.find params[:id]
    player.name = params[:name]
    player.nation = params[:nation]
    player.team = params[:team]
    player.overall = params[:overall]
    player.pac = params[:pac]
    player.sho = params[:sho]
    player.pas = params[:pas]
    player.dri = params[:dri]
    player.def = params[:def]
    player.phy = params[:phy]
    player.image = params[:image]
    player.save

INSERT INTO "players" ("name", "nation", "team", "pac", "sho", "pas", "dri", "def", "phy", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["name", "Tuan Tuan"], ["nation", "Australia"], ["team", "Real Madrid"], ["pac", 5], ["sho", 5], ["pas", 5], ["dri", 5], ["def", 5], ["phy", 5], ["image", "http://placekitten.com/100/100"]]
---
  def create
    player = Player.new
    player.name = params[:name]
    player.nation = params[:nation]
    player.team = params[:team]
    player.overall = params[:overall]
    player.pac = params[:pac]
    player.sho = params[:sho]
    player.pas = params[:pas]
    player.dri = params[:dri]
    player.def = params[:def]
    player.phy = params[:phy]
    player.image = params[:image]
    player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]
---
  def destroy
    player = Player.find params[:id]
    player.destroy

SELECT  "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "asd"], ["LIMIT", 1]]
---
  def search
    player = Player.find_by name: params[:name]