sean_mccusker/homework/week05/08-rails/moma/app/controllers/artists_controller.rb

  def show
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "dob", "period", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 9]]