bridget_mcmahon/week05/wednesday/world/app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def show
    @city = City.find params[:id]
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    city = City.create city_params
---
INSERT INTO "cities" ("name", "population", "image", "time_zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "blah"], ["population", "0"], ["image", ""], ["time_zone", ""], ["created_at", "2019-01-16 06:14:22.150104"], ["updated_at", "2019-01-16 06:14:22.150104"]]

  def edit
    @city = City.find params[:id]
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    city = City.find params[:id]
    city.update city_params
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "country_id" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["country_id", 1], ["updated_at", "2019-01-16 06:12:57.328669"], ["id", 1]]

  def destroy
    city = City.find params[:id]
    city.destroy
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 2]]