bridget_mcmahon/week05/wednesday/world/app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT "countries".* FROM "countries"

  def show
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    country = Country.create country_params
---
INSERT INTO "countries" ("name", "area", "population", "currency", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"