danny_ceccattini/week05/gastronomia/app/views/dishes/_form.html.erb

  <%= f.label :region_id %>
  <%= f.select :region_id, Region.pluck(:name, :id), :include_blank => true %>
---
SELECT "regions"."name", "regions"."id" FROM "regions"