danny_ceccattini/week05/gastronomia/app/views/dishes/show.html.erb

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<ul>
  <% if @dish.region.present? %>