david_pearl/week05/mountain_app/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains"
---
  def index
    @mountains = Mountain.all

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

INSERT INTO "mountains" ("name", "country", "height", "mountain_range", "image") VALUES (?, ?, ?, ?, ?)
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.mountain_range = params[:mountain_range]
    mountain.image = params[:image]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://cdn2.veltra.com/ptr/20160818022807_1080873029_10001_0.jpg?imwidth=550&impolicy=custom"], ["id", 4]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.mountain_range = params[:mountain_range]
    mountain.image = params[:image]
    mountain.save # UPDATE DB record with the new information.
