bridget_mcmahon/week05/tuesday/mountains_app/app/controllers/mountains_controller.rb

  def index
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.range = params[:range]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.type = params[:type]
    mountain.location = params[:location]
    mountain.save
---
INSERT INTO "mountains" ("name", "range", "image", "height", "type", "location") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.range = params[:range]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.type = params[:type]
    mountain.location = params[:location]
    mountain.save
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://cimages1.touristlink.com/data/cache/I/S/L/A/N/D/P/E/island-peak-6189-m-in-bad-weather-nepal-himalayas_640_480.jpg"], ["id", 4]]

  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 1]]