elli_motaghi/week05/homework/ocean_app/app/controllers/oceans_controller.rb

    def home
        @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

    def show
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def create
        ocean = Ocean.new
        ocean.name = params[:name]
        ocean.image = params[:image]
        ocean.area = params[:area]
        ocean.volume = params[:volume]
        ocean.ave_depth = params[:ave_depth]
        ocean.save
---
INSERT INTO "oceans" ("name", "area", "volume", "image") VALUES (?, ?, ?, ?)  [["name", "atlantic"], ["area", 23.0], ["volume", 23.0], ["image", "http://ontheworldmap.com/oceans-and-seas/atlantic-ocean/detailed-map-of-atlantic-ocean-with-cities.jpg"]]

    def edit
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        ocean = Ocean.find params[:id]
        ocean.name = params[:name]
        ocean.image = params[:image]
        ocean.area = params[:area]
        ocean.volume = params[:volume]
        ocean.ave_depth = params[:ave_depth]
        ocean.save
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "oceans" SET "image" = ? WHERE "oceans"."id" = ?  [["image", "https://www.whatarethe7continents.com/wp-content/uploads/2013/08/atlantic-ocean-map-1.png"], ["id", 3]]

    def destroy
        ocean = Ocean.find params[:id]
        ocean.destroy
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 4]]