shouyi_wang/week05/tuesday/mountains/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains"
---
  def index
    @mountains = Mountain.all

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

INSERT INTO "mountains" ("name", "image", "height", "location") VALUES (?, ?, ?, ?)  [["name", "Mount Everest"], ["image", "https://cdn.britannica.com/s:500x350/17/83817-004-C5DB59F8.jpg"], ["height", 8848.0], ["location", "Asia"]]
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.location = params[:location]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "height" = ? WHERE "mountains"."id" = ?  [["height", nil], ["id", 1]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.location = params[:location]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 3]]
---
  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy