shouyi_wang/week05/wednesday/bookauthor/app/views/books/_form.html.erb

  <%= f.label :author_id %>
  <%= f.select :author_id, Author.pluck(:name, :id), :include_blank => true %>
---
SELECT "authors"."name", "authors"."id" FROM "authors"