shouyi_wang/week05/wednesday/bookauthor/app/views/books/show.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
<%= image_tag @book.image, :alt => @book.name, :class => 'feature' %>
<% if @book.author.present? %>