william_ding/week05/wednesday/football_app_v2/app/controllers/application_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "Ronaldo One"], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."name" = $1 LIMIT $2  [["name", "Real Madrid"], ["LIMIT", 1]]
---
  def search
    if params[:player].present?
      player = Player.find_by name: params[:name]
      redirect_to player
    else
      team = Team.find_by name: params[:name]