william_ding/week05/wednesday/football_app_v2/app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT "countries".* FROM "countries"

  def show
    @country = Country.find params[:id]
    @teams = Team.all
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"