william_ding/week05/wednesday/football_app_v2/app/controllers/players_controller.rb

SELECT "players".* FROM "players" ORDER BY "players"."id" ASC
---
  def index
    @players = Player.all.order(:id)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @player = Player.find params[:id]

INSERT INTO "players" ("name", "nation", "team", "position", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "No one"], ["nation", ""], ["team", ""], ["position", ""], ["image", ""]]
---
  def create
    player = Player.create strong_params

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @player = Player.find params[:id]

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "players" SET "name" = $1 WHERE "players"."id" = $2  [["name", "Ronaldo Ten10"], ["id", 10]]
---
  def update
    player = Player.find params[:id]
    player.update strong_params

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 33]]
---
  def destroy
    player = Player.find params[:id]
    player.destroy