sean_mccusker/homework/week05/movie-directors/app/views/films/_form.html.erb

  <%= f.label :director_id %>
  <%= f.select :director_id, Director.pluck(:name, :id) %>
---
SELECT "directors"."name", "directors"."id" FROM "directors"