sean_mccusker/homework/week05/movie-directors/app/views/films/show.html.erb

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <li>Title: <%= @film.title %></li>
  <% if @film.director.present? %>