danny_ceccattini/week05/gastronomia/app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def show
    @dish = Dish.find params[:id]
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    dish = Dish.create dish_params
---
INSERT INTO "dishes" ("name", "course", "wine", "key_ingredient", "image", "region_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @dish = Dish.find params[:id]
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    dish = Dish.find params[:id]
    dish.update dish_params
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "dishes" SET "wine" = $1 WHERE "dishes"."id" = $2  [["wine", "Frascati Superiore DOCG"], ["id", 3]]

  def destroy
    dish = Dish.find params[:id]
    dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 2]]