danny_ceccattini/week05/gastronomia/app/controllers/regions_controller.rb

  def index
    @regions = Region.all
---
SELECT "regions".* FROM "regions"

  def show
    @region = Region.find params[:id]
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    region = Region.create region_params
---
INSERT INTO "regions" ("name", "capital", "population", "flag", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @region = Region.find params[:id]
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    region = Region.find params[:id]
    region.update region_params
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "regions" SET "population" = $1, "updated_at" = $2 WHERE "regions"."id" = $3  [["population", 3749431], ["updated_at", "2019-01-16 11:07:01.525792"], ["id", 1]]

  def destroy
    region = Region.find params[:id]
    region.destroy
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "regions" WHERE "regions"."id" = $1  [["id", 3]]