william_ding/week05/wednesday/football_app_v2/app/views/players/_form.html.erb

  <%= f.label :team_id %>
  <%= f.select  :team_id, Team.pluck(:name, :id)%>
---
SELECT "teams"."name", "teams"."id" FROM "teams"