shouyi_wang/week05/wednesday/bookauthor/app/controllers/authors_controller.rb

  def show
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    author = Author.create author_params
---
INSERT INTO "authors" ("name", "nationality", "dob", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Shouyi Wang"], ["nationality", "Chinese"], ["dob", "1987-08-04"], ["image", ""], ["created_at", "2019-01-16 22:13:04.371884"], ["updated_at", "2019-01-16 22:13:04.371884"]]