shouyi_wang/week05/wednesday/bookauthor/app/controllers/books_controller.rb

  def show
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    book = Book.create book_params
---
INSERT INTO "books" ("name", "image", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hahaha"], ["image", ""], ["created_at", "2019-01-16 22:13:23.010937"], ["updated_at", "2019-01-16 22:13:23.010937"], ["author_id", 3]]

  def edit
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    book = Book.find params[:id]
    book.update book_params
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "author_id" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author_id", 4], ["updated_at", "2019-01-16 22:25:44.807308"], ["id", 3]]