shouyi_wang/week05/wednesday/bookauthor/app/views/authors/show.html.erb


<% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 3]]