danny_ceccattini/week05/summits/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains"
---
  def index
    @mountains = Mountain.all

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

INSERT INTO "mountains" ("name", "location", "height", "image", "white_man") VALUES (?, ?, ?, ?, ?)  [["name", "K2"], ["location", "Pakistan"], ["height", 8611], ["image", "https://upload.wikimedia.org/wikipedia/commons/1/12/K2_2006b.jpg"], ["white_man", "Achille Compagnoni"]]
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.location = params[:location]
    mountain.height = params[:height]
    mountain.image = params[:image]
    mountain.white_man = params[:white_man]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "mountains" SET "height" = ? WHERE "mountains"."id" = ?  [["height", 8586], ["id", 5]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.location = params[:location]
    mountain.height = params[:height]
    mountain.image = params[:image]
    mountain.white_man = params[:white_man]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 5]]
---
  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy